---
kind: type
id: T:Autodesk.Revit.DB.Electrical.Wire
source: html/c2acf13b-0d8b-8415-9682-ae64eb5e5895.htm
---
# Autodesk.Revit.DB.Electrical.Wire

Electrical wire element.

## Syntax (C#)
```csharp
public class Wire : MEPCurve
```